RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_qspi.c
/*!< Parameter valid check for extend address */
#define IS_VALID_SET_EXTEND_ADDR(x)             ((x) <= 0x3Fu)

/*!< Parameter valid check for get flag type */
#define IS_VALID_GET_FLAG_TYPE(x)                                              \
(   (QspiFlagBusBusy == (x))                    ||                             \
    (QspiFlagXipMode == (x))                    ||                             \
    (QspiFlagRomAccessError == (x))             ||                             \
    (QspiFlagPrefetchBufferFull == (x))         ||                             \
    (QspiFlagPrefetchStop == (x)))

/*!< Parameter valid check for clear flag type */
#define IS_VALID_CLEAR_FLAG_TYPE(x)             (QspiFlagRomAccessError == (x))

/*!< QSPI registers reset value */
#define QSPI_REG_CR_RESET_VALUE                 (0x003F0000ul)
#define QSPI_REG_CSCR_RESET_VALUE               (0x0000000Ful)
#define QSPI_REG_FCR_RESET_VALUE                (0x000080B3ul)
#define QSPI_REG_SR_RESET_VALUE                 (0x00008000ul)
#define QSPI_REG_CCMD_RESET_VALUE               (0x00000000ul)
#define QSPI_REG_XCMD_RESET_VALUE               (0x000000FFul)
#define QSPI_REG_EXAR_RESET_VALUE               (0x00000000ul)
#define QSPI_REG_SR2_RESET_VALUE                (0x00000000ul)
#define QSPI_REG_DCOM_RESET_VALUE               (0x00000000ul)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief De-Initialize QSPI unit
 **
 ** \param [in] None
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t QSPI_DeInit(void)
{
    en_result_t enRet = Ok;

    M4_QSPI->CR = QSPI_REG_CR_RESET_VALUE;
    if (1u == M4_QSPI->SR_f.RAER)
    {
        M4_QSPI->SR2_f.RAERCLR = 1u;
    }
    M4_QSPI->CSCR = QSPI_REG_CSCR_RESET_VALUE;
    M4_QSPI->FCR = QSPI_REG_FCR_RESET_VALUE;
    M4_QSPI->EXAR = QSPI_REG_EXAR_RESET_VALUE;
    M4_QSPI->SR = QSPI_REG_SR_RESET_VALUE;
    M4_QSPI->CCMD = QSPI_REG_CCMD_RESET_VALUE;
    M4_QSPI->XCMD = QSPI_REG_XCMD_RESET_VALUE;
    M4_QSPI->DCOM = QSPI_REG_DCOM_RESET_VALUE;
    M4_QSPI->SR2 = QSPI_REG_SR2_RESET_VALUE;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Initialize QSPI unit
 **
 ** \param [in] pstcQspiInitCfg         Pointer to qspi configuration
 ** \arg See the struct #stc_qspi_init_t
 **
 ** \retval Ok                          Process successfully done
 ** \retval Error                       Parameter error
 **
 ******************************************************************************/
en_result_t QSPI_Init(const stc_qspi_init_t *pstcQspiInitCfg)
{
    en_result_t enRet = Ok;

    if (NULL == pstcQspiInitCfg)
    {
        enRet = Error;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_CLK_DIV(pstcQspiInitCfg->enClkDiv));
        DDL_ASSERT(IS_VALID_SPI_MODE(pstcQspiInitCfg->enSpiMode));
        DDL_ASSERT(IS_VALID_BUS_COMM_MODE(pstcQspiInitCfg->enBusCommMode));
        DDL_ASSERT(IS_VALID_PREFETCH_STOP_LOCATION(pstcQspiInitCfg->enPrefetchMode));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcQspiInitCfg->enPrefetchFuncEn));
        DDL_ASSERT(IS_VALID_RECE_DATA_PROTOCOL(pstcQspiInitCfg->stcCommProtocol.enReceProtocol));
        DDL_ASSERT(IS_VALID_TRANS_ADDR_PROTOCOL(pstcQspiInitCfg->stcCommProtocol.enTransAddrProtocol));
        DDL_ASSERT(IS_VALID_TRANS_INSTRUCT_PROTOCOL(pstcQspiInitCfg->stcCommProtocol.enTransInstrProtocol));
        DDL_ASSERT(IS_VALID_INTERFACE_READ_MODE(pstcQspiInitCfg->stcCommProtocol.enReadMode));
        DDL_ASSERT(IS_VALID_QSSN_VALID_EXTEND_TIME(pstcQspiInitCfg->enQssnValidExtendTime));
        DDL_ASSERT(IS_VALID_QSSN_INTERVAL_TIME(pstcQspiInitCfg->enQssnIntervalTime));
        DDL_ASSERT(IS_VALID_QSCK_DUTY_CORR(pstcQspiInitCfg->enQsckDutyCorr));
        DDL_ASSERT(IS_VALID_VIRTUAL_CYCLES(pstcQspiInitCfg->enVirtualPeriod));
        DDL_ASSERT(IS_VALID_WP_OUTPUT_LEVEL(pstcQspiInitCfg->enWpPinLevel));
        DDL_ASSERT(IS_VALID_QSSN_SETUP_DELAY(pstcQspiInitCfg->enQssnSetupDelayTime));
        DDL_ASSERT(IS_VALID_QSSN_HOLD_TIME(pstcQspiInitCfg->enQssnHoldDelayTime));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcQspiInitCfg->enFourByteAddrReadEn));
        DDL_ASSERT(IS_VALID_INTERFACE_ADDR_WIDTH(pstcQspiInitCfg->enAddrWidth));

        /* Configure control register */
        M4_QSPI->CR_f.DIV = pstcQspiInitCfg->enClkDiv;
        M4_QSPI->CR_f.SPIMD3 = pstcQspiInitCfg->enSpiMode;
        M4_QSPI->CR_f.PFE = pstcQspiInitCfg->enPrefetchFuncEn;
        M4_QSPI->CR_f.PFSAE = pstcQspiInitCfg->enPrefetchMode;
        M4_QSPI->CR_f.MDSEL = pstcQspiInitCfg->stcCommProtocol.enReadMode;

        /* Custom read mode */
        if ((QspiReadModeCustomFast == pstcQspiInitCfg->stcCommProtocol.enReadMode) ||
            (QspiReadModeCustomStandard == pstcQspiInitCfg->stcCommProtocol.enReadMode))
        {
            M4_QSPI->CR_f.IPRSL = pstcQspiInitCfg->stcCommProtocol.enTransInstrProtocol;
            M4_QSPI->CR_f.APRSL = pstcQspiInitCfg->stcCommProtocol.enTransAddrProtocol;
            M4_QSPI->CR_f.DPRSL = pstcQspiInitCfg->stcCommProtocol.enReceProtocol;
        }
        else
        {
            M4_QSPI->CR_f.IPRSL = QspiProtocolExtendSpi;
            M4_QSPI->CR_f.APRSL = QspiProtocolExtendSpi;
            M4_QSPI->CR_f.DPRSL = QspiProtocolExtendSpi;
        }

