RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_qspi.c
    DDL_ASSERT(IS_VALID_WP_OUTPUT_LEVEL(enWpLevel));

    M4_QSPI->FCR_f.WPOL = enWpLevel;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set communication address width
 **
 ** \param [in] enAddrWidth             Communication address width
 ** \arg QspiAddressByteOne             One byte address
 ** \arg QspiAddressByteTwo             Two byte address
 ** \arg QspiAddressByteThree           Three byte address
 ** \arg QspiAddressByteFour            Four byte address
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t QSPI_SetAddrWidth(en_qspi_addr_width_t enAddrWidth)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_INTERFACE_ADDR_WIDTH(enAddrWidth));

    M4_QSPI->FCR_f.AWSL = enAddrWidth;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set extend address value
 **
 ** \param [in] u8Addr                  Extend address value
 ** \arg 0~0x3F
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t QSPI_SetExtendAddress(uint8_t u8Addr)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_SET_EXTEND_ADDR(u8Addr));

    M4_QSPI->EXAR_f.EXADR = u8Addr;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set rom access instruction
 **
 ** \param [in] u8Instr                 Rom access instruction
 ** \arg 0~0xFF
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t QSPI_SetRomAccessInstruct(uint8_t u8Instr)
{
    en_result_t enRet = Ok;

    M4_QSPI->CCMD = u8Instr;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Write direct communication value
 **
 ** \param [in] u8Val                   Direct communication value
 ** \arg 0~0xFF
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t QSPI_WriteDirectCommValue(uint8_t u8Val)
{
    en_result_t enRet = Ok;

    M4_QSPI->DCOM = u8Val;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Read direct communication value
 **
 ** \param [in] None
 **
 ** \retval uint8_t                     Direct communication read value
 **
 ******************************************************************************/
uint8_t QSPI_ReadDirectCommValue(void)
{
    return ((uint8_t)M4_QSPI->DCOM);
}

/**
 *******************************************************************************
 ** \brief Enable or disable xip mode
 **
 ** \param [in] u8Instr                 Enable or disable xip mode instruction
 ** \arg 0~0xFF
 **
 ** \param [in] enNewSta                The function new state
 ** \arg Disable                        Disable xip mode
 ** \arg Enable                         Enable xip mode
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t QSPI_XipModeCmd(uint8_t u8Instr, en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    M4_QSPI->XCMD = u8Instr;
    if (Enable == enNewSta)
    {
        M4_QSPI->CR_f.XIPE = 1u;
    }
    else
    {
        M4_QSPI->CR_f.XIPE = 0u;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Enter direct communication mode
 **
 ** \param [in] None
 **
 ** \retval Ok                          Process successfully done
 **
 ** \note If you are in XIP mode, you need to exit XIP mode and then start direct communication mode.
 **
 ******************************************************************************/
en_result_t QSPI_EnterDirectCommMode(void)
{
    en_result_t enRet = Ok;

    M4_QSPI->CR_f.DCOME = 1u;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Exit direct communication mode
 **
 ** \param [in] None
 **
 ** \retval Ok                          Process successfully done
 **
 ******************************************************************************/
en_result_t QSPI_ExitDirectCommMode(void)
{
    en_result_t enRet = Ok;

    M4_QSPI->CR_f.DCOME = 0u;

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get prefetch buffer current byte number
 **
 ** \param [in] None
 **
 ** \retval uint8_t                     Current buffer byte number
 **
 ******************************************************************************/
uint8_t QSPI_GetPrefetchBufferNum(void)
{
    return ((uint8_t)M4_QSPI->SR_f.PFNUM);
}

/**
 *******************************************************************************
 ** \brief Get flag status
 **
 ** \param [in] enFlag                  Choose need get status's flag
 ** \arg QspiFlagBusBusy                QSPI bus work status flag in direct communication mode
 ** \arg QspiFlagXipMode                XIP mode status signal
 ** \arg QspiFlagRomAccessError         Trigger rom access error flag in direct communication mode
 ** \arg QspiFlagPrefetchBufferFull     Prefetch buffer area status signal
 ** \arg QspiFlagPrefetchStop           Prefetch  action status signal
 **
 ** \retval Set                         Flag is set
 ** \retval Reset                       Flag is reset
 **
 ******************************************************************************/
en_flag_status_t QSPI_GetFlag(en_qspi_flag_type_t enFlag)
{
    en_flag_status_t enFlagSta = Reset;

    DDL_ASSERT(IS_VALID_GET_FLAG_TYPE(enFlag));

    switch (enFlag)
    {
        case QspiFlagBusBusy:
            enFlagSta = (en_flag_status_t)M4_QSPI->SR_f.BUSY;
            break;
        case QspiFlagXipMode:
            enFlagSta = (en_flag_status_t)M4_QSPI->SR_f.XIPF;
            break;
        case QspiFlagRomAccessError:
            enFlagSta = (en_flag_status_t)M4_QSPI->SR_f.RAER;
            break;
        case QspiFlagPrefetchBufferFull:
            enFlagSta = (en_flag_status_t)M4_QSPI->SR_f.PFFUL;
            break;
        case QspiFlagPrefetchStop:
            enFlagSta = (en_flag_status_t)M4_QSPI->SR_f.PFAN;
            break;
        default:
            break;
    }

    return enFlagSta;
}

/**
 *******************************************************************************
 ** \brief Clear flag status
 **
 ** \param [in] enFlag                  Choose need get status's flag
 ** \arg QspiFlagRomAccessError         Trigger rom access error flag in direct communication mode
 **
 ** \retval Ok                          Process successfully done
 ** \retval ErrorInvalidParameter       Parameter error
 **
 ******************************************************************************/
en_result_t QSPI_ClearFlag(en_qspi_flag_type_t enFlag)
{
    en_result_t enRet = Ok;

    if (QspiFlagRomAccessError == enFlag)
    {
        M4_QSPI->SR2_f.RAERCLR = 1u;
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

//@} // QspiGroup

#endif /* DDL_QSPI_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
